 ![png](image_books_erd.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [4]:
q= '''SELECT * FROM books'''
pd.read_sql(q, conn)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [5]:
# Read in the  data and preview
books = pd.read_csv('data/books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [6]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO         None

In [7]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'title', 'author_id'], dtype=object)

In [8]:
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [9]:
# books.rename(columns={"author_Author ID":"authors_id", "Title":'title', "Book ID": 'id'}, inplace=True)

In [10]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO         None

In [11]:
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [12]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     1

In [13]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [14]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     0

In [ ]:
#inserting data
books.to_sql("books",conn,index=False, if_exists='append')

In [ ]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

In [ ]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

In [ ]:
# Checking describe's Field names
describe['Field'].values

In [ ]:
# Read in the  data and preview
users = pd.read_csv('data/users.csv')
users.info()
users.head()

In [ ]:
users.dtypes

In [ ]:
users.to_sql("users",conn,index=False, if_exists='append')

In [ ]:
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

In [ ]:
authors = pd.read_csv('data/authors.csv')
authors.info()
authors.head()

In [ ]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

In [ ]:
describe['Field'].values

In [ ]:
authors.dtypes

In [ ]:
authors.to_sql("authors",conn,index=False, if_exists='append')

In [ ]:
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

In [ ]:
favorites = pd.read_csv('data/favorites.csv')
favorites.info()
favorites.head()

In [ ]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

In [ ]:
describe['Field'].values

In [ ]:
favorites.dtypes

In [ ]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

In [ ]:

q = """
SELECT books.title, favorites.user_id 
FROM books 
JOIN favorites ON books.id = favorites.books_id 
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q,conn)